<?php
session_start();
$lg = $_SESSION['LG'];
$pas = $_SESSION['PAS'];

include_once "../function.php";

$kl = $_GET['kl'];

$db = mysql_connect("localhost", $lg, $pas);
if (!$db) echo "Не вiдбулося зєднання з базою даних";

if (!@mysql_select_db(kpbti, $db)) {
    echo("Не завантажена таблиця");
    exit();
}

$sql = "SELECT zamovlennya.*,dlya_oformlennya.document,dlya_oformlennya.name_for_dog,
                rayonu.RAYON,rayonu.ID_RAYONA,nas_punktu.NSP,tup_nsp.TIP_NSP,dlya_oformlennya.id_oform,
				vulutsi.VUL,tup_vul.TIP_VUL,zamovlennya.SZ,zamovlennya.NZ 
				FROM zamovlennya,rayonu,nas_punktu, vulutsi, tup_nsp, tup_vul, dlya_oformlennya
				WHERE 
					zamovlennya.KEY='$kl'
					AND zamovlennya.DL='1' AND dlya_oformlennya.id_oform=zamovlennya.VUD_ROB
					AND rayonu.ID_RAYONA=RN AND nas_punktu.ID_NSP=NS AND vulutsi.ID_VUL=VL
					AND tup_nsp.ID_TIP_NSP=nas_punktu.ID_TIP_NSP
					AND tup_vul.ID_TIP_VUL=vulutsi.ID_TIP_VUL";
$atu = mysql_query($sql);
while ($aut = mysql_fetch_array($atu)) {
    $t_zak = $aut["TUP_ZAM"];
    $kod_rn = $aut["ID_RAYONA"];
    $b_rn = p_buk($aut["RAYON"]);
    $ndog = get_num_order($kod_rn, $aut["SZ"], $aut["NZ"]);
    $dtdog = german_date($aut["D_PR"]);
    $datavuh = german_date($aut["DATA_VUH"]);
    $datagot = german_date($aut["DATA_GOT"]);
    $pruymalnuk = $aut["PR_OS"];
    $idn = $aut["IDN"];
    $vidrob = $aut["name_for_dog"];
    $kod_rob = $aut["id_oform"];
    $zamovnuk = $aut["PR"] . ' ' . $aut["IM"] . ' ' . $aut["PB"];
    $vlasnuk = $aut["PRVL"] . ' ' . $aut["IMVL"] . ' ' . $aut["PBVL"];
    $passport_vl = (!empty($aut["PASPORTVL"]))? 'Паспорт: ' . $aut["PASPORTVL"]: '';

    $zayavnuk = $aut["PR"] . ' ' . p_buk($aut["IM"]) . '.' . p_buk($aut["PB"]) . '.';
    $pasport = $aut["PASPORT"];
    $primitka = $aut["PRIM"];

    if ($aut["BUD"] != "") $bud = "буд." . $aut["BUD"]; else $bud = "";
    if ($aut["KVAR"] != "") $kvar = ", кв." . $aut["KVAR"]; else $kvar = "";
    $adresa = $aut["TIP_NSP"] . ' ' . $aut["NSP"] . ', ' . $aut["TIP_VUL"] . ' ' . $aut["VUL"] . ', ' . $bud . $kvar;
    $adresa_title1 = $aut["TIP_NSP"] . ' ' . $aut["NSP"] . ', ' . $aut["TIP_VUL"] . ' ' . $aut["VUL"] . ',';
    $adresa_title2 = $bud . $kvar;
    $vart = $aut["SUM"];/* +$aut["SUM_D"] */
    $tel = $aut["TEL"];
    $term = $aut["TERM"];
}
mysql_free_result($atu);

$dodvl = '';
$sql = "SELECT PR,IM,PB	FROM zm_dod WHERE IDZM='$kl'";
$atu = mysql_query($sql);
while ($aut = mysql_fetch_array($atu)) {
    $dodvl .= ', ' . $aut["PR"] . ' ' . $aut["IM"] . ' ' . $aut["PB"];
}
mysql_free_result($atu);

$grn = (int)$vart;
$kop = fract($vart);
$sumpr = in_str($grn);
if ($kop != 0) $smpr = $sumpr . ' грн. ' . $kop . ' коп.';
else $smpr = $sumpr . ' грн. ';

require('../tfpdf/tfpdf.php');
// створюємо FPDF обєкт
$pdf = new TFPDF();

$pdf->SetAutoPageBreak('true', 2);
$pdf->SetMargins(05, 05, 2);

$pdf->AddFont('dejavu', '', 'DejaVuSans.ttf', true);
$pdf->AddFont('dejavub', '', 'DejaVuSans-Bold.ttf', true);

// Вказуємо автора та заголовок
$pdf->SetAuthor('КП КОР "КИЇВСЬКЕ ОБЛАСНЕ БТІ"');
$pdf->SetTitle('Замовлення');

//створюємо нову сторiнку та вказуємо режим її вiдображення
$pdf->AddPage('P');
$pdf->SetDisplayMode('real', 'default');

$pdf->SetXY(05, 05);
$pdf->SetDrawColor(50, 60, 100);

$pdf->SetFont('dejavu', '', 8);
$pdf->Text(188, 10, 'Замовник:');

$pdf->Text(120, 15, 'Гром.');
$pdf->SetFont('dejavub', '', 8);
$pdf->Text(130, 15, $zamovnuk);
$pdf->SetFont('dejavu', '', 8);
$pdf->Text(120, 19, $pasport);
if (!empty($idn)) $pdf->Text(136, 19, ', ІПН:' . $idn);
$pdf->Text(120, 23, $adresa_title1);
$pdf->Text(120, 27, $adresa_title2);
$pdf->Text(120, 31, 'Телефон: ' . $tel);

if ($zamovnuk != $vlasnuk) {
    $pdf->Text(188, 35, 'Власник:');
    $pdf->Text(120, 40, 'Гром.');
    $pdf->SetFont('dejavub', '', 8);
    $pdf->Text(130, 40, $vlasnuk);
    $pdf->SetFont('dejavu', '', 8);
    $pdf->Text(120, 44, $passport_vl);
}

$pdf->SetFont('dejavu', '', 10);
$y = 15;
$pdf->Text(65, 40 + $y, 'ЗАМОВЛЕННЯ-ЗОБОВ`ЯЗАННЯ № ');
$pdf->SetFont('dejavub', '', 10);
$pdf->Text(128, 40 + $y, $ndog);
$pdf->SetFont('dejavu', '', 8);
$pdf->Text(95, 44 + $y, 'від ' . $dtdog . 'р.');
$pdf->Text(15, 48 + $y, 'Вид робіт: ' . $vidrob);
$pdf->SetFont('dejavub', '', 8);
$pdf->Text(15, 52 + $y, 'далі за текстом Об`єкту, що знаходиться за адресою:');
$y += 4;
$pdf->Text(15, 52 + $y, $adresa);
$pdf->SetFont('dejavu', '', 8);
$pdf->Text(15, 56 + $y, 'Зобов`язання та гарантії:');
$pdf->SetXY(15, 57 + $y);
$pdf->MultiCell(190, 4, '1. Засвідчую, що до комунального підприємства Київської обласної ради "КИЇВСЬКЕ ОБЛАСНЕ БТІ" (далі –БТІ) надані всі наявні документи щодо Об`єкта, на підтвердження законності та належності;', 0, 'L', 0);
$pdf->SetXY(15, 65 + $y);
$pdf->MultiCell(190, 4, '1.1. БТІ гарантує наявність належних документів та кваліфікаційних сертифікатів, передбачених  чинним законодавством України для виконання даного виду робіт, і буде підтримувати їх в силі протягом строку дії цього Замовлення-зобовязання;', 0, 'L', 0);
$pdf->SetXY(15, 73 + $y);
$pdf->MultiCell(190, 4, '1.2. БТІ не розпочинає виконання робіт до моменту проведення оплати авансу та отримання необхідних документів для виконання робіт;', 0, 'L', 0);
$pdf->SetXY(15, 81 + $y);
$pdf->MultiCell(190, 4, '1.3.У випадку надання Замовником неточних, або недостовірних необхідних документів, БТІ звільняється  від  відповідальності, а виконанні роботи вважаються виконаними належним чином і підлягають оплаті відповідно до цього Замовлення-зобов`язання;', 0, 'L', 0);
$pdf->Text(16, 96 + $y, '2. Підписанням даного ЗАМОВЛЕННЯ-ЗОБОВ`ЯЗАННЯ зобов`язуюсь *:');
$pdf->SetXY(15, 97 + $y);
$pdf->MultiCell(190, 4, '2.1. Не пізніше трьох робочих днів з дня складання даного Замовлення-зобов`язання здійснити передоплату  (авансовий платіж) на розрахунковий рахунок БТІ у розмірі ' . $vart . ' грн (' . $smpr . ');', 0, 'L', 0);
$pdf->SetXY(15, 105 + $y);
$pdf->MultiCell(190, 4, '2.2. Забезпечити представникам БТІ доступ у всі будівлі та приміщення власників, співвласників Об`єкту за конкретною адресою для здійснення їх обміру та обстеження;', 0, 'L', 0);
$pdf->SetXY(15, 113 + $y);
$pdf->MultiCell(190, 4, '2.3. Забезпечити власну присутність або присутність повноважного представника за дорученням на об’єкті  під час здійснення робіт з інвентаризації та контролю;', 0, 'L', 0);
$pdf->SetXY(15, 121 + $y);
$pdf->MultiCell(190, 4, '2.4. По закінченні обстеження (контролю) забезпечити підписання власноруч (чи представником за дорученням) абрису, ескізу та інших необхідних документів;', 0, 'L', 0);
$pdf->SetXY(15, 129 + $y);
$pdf->MultiCell(190, 4, '2.5. Протягом 2-х днів з дня отримання  квитанції  здійснити остаточний розрахунок з БТІ **;', 0, 'L', 0);
$pdf->SetXY(15, 133 + $y);
$pdf->MultiCell(190, 4, '2.6. Вжити заходів щодо забезпечення безпеки проведення інвентаризаційних робіт (в разі необхідності провести відповідний інструктаж представників БТІ);', 0, 'L', 0);
$pdf->SetXY(15, 141 + $y);
$pdf->MultiCell(190, 4, '2.7. В разі попереднього повідомлення за три робочі дні, забезпечити можливість проведення контролю якості виконання робіт з інвентаризації;', 0, 'L', 0);
$pdf->SetXY(15, 149 + $y);
$pdf->MultiCell(190, 4, '2.8 У випадку порушення Замовником зобов’язання даного договору, Виконавець має право відмовитись від даного договору (припинити його юридичну дію) в односторонньому порядку.', 0, 'L', 0);
$pdf->SetXY(15, 157 + $y);
$pdf->MultiCell(190, 4, '3. У разі невиконання  Замовлення-зобов`язання в строк до 15-ти календарних днів, з причин залежних від Замовника, (не надання повного пакету документів, доступу у всі  будівлі та приміщення для обмірів та обстеження, забезпечення безпеки при проведенні технічної інвентаризації, забезпечення присутності власника або уповноваженої особи, тощо), авансовий платіж не повертається.', 0, 'L', 0);
$pdf->SetXY(15, 173 + $y);
$pdf->MultiCell(190, 4, '4. Відповідно до положень Закону України “Про захист персональних даних”, надаю згоду на обробку моїх персональних даних БТІ, а саме: на обробку виданих на моє ім`я документів, підписаних мною документів та відомостей, що надаються мною.', 0, 'L', 0);
$pdf->SetXY(15, 185 + $y);
$pdf->MultiCell(190, 4, '5. Оплата авансу та надання необхідних документів для виконання робіт вважається згодою на початок робіт;', 0, 'L', 0);
$pdf->SetXY(15, 189 + $y);
$pdf->MultiCell(190, 4, '* БТІ зобов`язується виконати замовлення в повному обсязі протягом 30-ти календарних днів, в разі терміновості - протягом трьох робочих днів, за відсутності порушень Замовником, передбачених пунктом 3, 2.', 0, 'L', 0);
$pdf->SetXY(15, 197 + $y);
$pdf->MultiCell(190, 4, '** В разі порушення обов`язків, передбачених підпунктами 2.1, 2.2, 2.3, 2.4, 2.7 БТІ має право відмовитись від проведення інвентаризації та повернути отримані документи без виконання. Достатнім доказом порушення є складений БТІ акт про ненадання можливості обстеження.', 0, 'L', 0);
$pdf->SetXY(15, 209 + $y);
$pdf->MultiCell(190, 4, '*** Повторний виїзд представника БТІ на Об`єкт можливий лише після повторного оформлення замовлення-зобов`язання та сплати авансу.', 0, 'L', 0);
$pdf->SetXY(15, 217 + $y);
$pdf->MultiCell(190, 4, '**** Загальна вартість виконання замовлення розраховується згідно Збірника норм часу на роботи та послуги, що виконуються бюро технічної інвентаризації України, з врахуванням вартості 1 нормо-години 159.52 грн.', 0, 'L', 0);
$pdf->SetXY(15, 225 + $y);
$pdf->MultiCell(190, 4, '***** Період звернення щодо усунення помилок складає - 14 каландарних днів з дня отримання звернення.', 0, 'L', 0);
$pdf->SetXY(15, 229 + $y);
$pdf->MultiCell(190, 4, '****** У разі виконання замовлення в скорочений термін до вартості 1 нормо-години застосовується коефіцієнт 2.', 0, 'L', 0);

$pdf->SetXY(15, 233 + $y);
$pdf->MultiCell(190, 4, '******* Підтвердженням виконаної роботи є Акт виконаних робіт та 100% оплата за виконання робіт.', 0, 'L', 0);

$pdf->Text(15, 240 + $y, 'Відомості надані мною щодо об`єкту:');
$pdf->Text(15, 244 + $y, 'Документи:');
$pdf->Text(15, 250 + $y, $dtdog . 'р.                     ____________________________________ (' . $zamovnuk . ')');
$pdf->Text(15, 257 + $y, 'Прошу виконати замовлення в скорочений термін (3-и робочі дні)******    ___________________________________________');
$pdf->SetFont('dejavu', '', 7);
$pdf->Text(150, 260 + $y, 'підпис, П.І.Б.');
$pdf->SetFont('dejavu', '', 8);
$pdf->Text(15, 268 + $y, 'Замовлення-зобов`язання прийняв    ________________________  (' . $pruymalnuk . ')   ' . $dtdog . ' р.');

//------------------------------Запит----------------------------------
$pdf->AddPage('P');
$pdf->SetDisplayMode('real', 'default');
$pdf->SetXY(05, 05);
$pdf->SetFont('dejavu', '', 14);
$pdf->Text(70, 15, 'КИЇВСЬКА ОБЛАСНА РАДА');
$pdf->Text(30, 25, 'КОМУНАЛЬНЕ ПІДПРИЄМСТВО КИЇВСЬКОЇ ОБЛАСНОЇ РАДИ');
$pdf->SetFont('dejavu', '', 16);
$pdf->Text(22, 35, '«КИЇВСЬКЕ ОБЛАСНЕ БЮРО ТЕХНІЧНОЇ ІНВЕНТАРИЗАЦІЇ»');
$pdf->SetFont('dejavu', '', 10);
$pdf->Text(25, 42, '07400, м. Бровари, вул. Шевченка, 8а, тел. моб. +38 098 012 28 02, ЄДРПОУ 38250947');
$pdf->Text(75, 47, 'e-mail: livoberegne.bti@gmail.com');
$pdf->SetLineWidth(1);
$pdf->Line(15, 50, 195, 50);
$pdf->SetXY(130, 60);
$pdf->SetLineWidth(0.2);
$pdf->SetFont('dejavu', '', 12);
$pdf->MultiCell(60, 6, 'КП КОР «ЗБЕРІГАЧ»
Генеральний директор
О.Я.Костиліна', 0, 'L', 0);
$pdf->Line(132, 85, 190, 85);
$pdf->SetFont('dejavu', '', 7);
$pdf->Text(132, 90, '08202, Київська обл., м. Ірпінь, вул. Миру, 2а');
$pdf->SetFont('dejavu', '', 14);
$pdf->Text(95, 115, 'ЗАПИТ');
$pdf->SetFont('dejavu', '', 12);
$pdf->SetXY(20, 130);
$pdf->MultiCell(185, 6, '  Для проведення технічної інвентаризації об’єкта нерухомого майна відповідно до договору від ' . $dtdog . 'р. №' . $ndog . ', укладеного з ' . $zamovnuk . ', просимо надати належним чином засвідчені копії матеріалів попередньої технічної інвентаризації на об’єкт нерухомого майна, що знаходиться за адресою:
' . $adresa, 0, 'L', 0);
$pdf->SetFont('dejavu', '', 8);
$pdf->Line(21, 166, 202, 166);
$pdf->Text(85, 170, '(назва об’єкта нерухомості)');
$pdf->SetFont('dejavu', '', 12);
$pdf->Text(21, 180, 'Відповідь просимо надіслати у встановлений законодавством строк за адресою:');
$pdf->Text(21, 186, '07401, Київська обл., м. Бровари, вул. Шевченка, 8а');
$pdf->Text(21, 200, 'Додатки:');
$pdf->Text(21, 210, '1. Копія договору від ' . $dtdog . 'р. №' . $ndog . ', засвідчена належним чином.');
$pdf->Text(21, 220, '2. Копія довіреності від _____________________, засвідчена належним чином.');
$pdf->Text(21, 230, '3. Копії документів, що засвідчують право замовника на об’єкт нерухомого майна.');
$pdf->SetFont('dejavub', '', 10);
$pdf->Text(21, 255, 'Керівник суб’єкта господарювання');
$pdf->Line(105, 255, 145, 255);
$pdf->Text(155, 255, 'О.Є. Кондратенко');
$pdf->SetFont('dejavu', '', 8);
$pdf->Text(120, 259, '(підпис)');
$pdf->Text(170, 259, '(П. І. Б.)');
//---------------------------------------------------------------------

//Zakrutie bazu
if (mysql_close($db)) {
    // echo("Закриття бази даних");
} else {
    echo("Не можливо виконати закриття бази");
}
$pdf->Output('dogovir.pdf', 'I');
