<?php
session_start();
$lg = $_SESSION['LG'];
$pas = $_SESSION['PAS'];

include_once "../function.php";
$user = p_buk($_SESSION['IM']) . '.' . p_buk($_SESSION['PB']) . '.' . ' ' . $_SESSION['PR'];

$kl = $_GET['kl'];

$db = mysql_connect("localhost", $lg, $pas);
if (!$db) echo "Не вiдбулося зєднання з базою даних";

if (!@mysql_select_db(kpbti, $db)) {
    echo("Не завантажена таблиця");
    exit();
}

$sql = "SELECT arhiv_zakaz.*,arhiv_jobs.name,rayonu.RAYON,rayonu.ID_RAYONA,nas_punktu.NSP, tup_nsp.TIP_NSP,
		    arhiv_jobs.id,vulutsi.VUL,tup_vul.TIP_VUL,arhiv_dop_adr.bud,arhiv_dop_adr.kvar 
		FROM arhiv_zakaz 
            LEFT JOIN arhiv_jobs ON arhiv_zakaz.VUD_ROB=arhiv_jobs.id 
            LEFT JOIN arhiv_dop_adr ON arhiv_zakaz.KEY=arhiv_dop_adr.id_zm 
            LEFT JOIN rayonu ON rayonu.ID_RAYONA=arhiv_dop_adr.rn 
            LEFT JOIN nas_punktu ON nas_punktu.ID_NSP=arhiv_dop_adr.ns 
            LEFT JOIN vulutsi ON vulutsi.ID_VUL=arhiv_dop_adr.vl
            LEFT JOIN tup_nsp ON tup_nsp.ID_TIP_NSP=nas_punktu.ID_TIP_NSP
            LEFT JOIN tup_vul ON tup_vul.ID_TIP_VUL=vulutsi.ID_TIP_VUL
		WHERE 
		    arhiv_zakaz.KEY='$kl' AND arhiv_zakaz.DL='1' LIMIT 1";

$atu = mysql_query($sql);
while ($aut = mysql_fetch_array($atu)) {
//    $t_zak = $aut["TUP_ZAM"];
    $kod_rn = $aut["ID_RAYONA"];
//    $b_rn = p_buk($aut["RAYON"]);
    $ndog = get_num_order($kod_rn, $aut["SZ"] , $aut["NZ"]);
    $dtdog = german_date($aut["D_PR"]);
//    $datavuh = german_date($aut["DATA_VUH"]);
//    $datagot = german_date($aut["DATA_GOT"]);
    $pruymalnuk = $aut["PR_OS"];
    $edrpou = $aut["EDRPOU"];
    $vidrob = $aut["name"];
    $kod_rob = $aut["id"];
    $zamovnuk = $aut["PR"] . ' ' . $aut["IM"] . ' ' . $aut["PB"];
    $zayavnuk = p_buk($aut["IM"]) . '.' . p_buk($aut["PB"]) . '. ' . $aut["PR"];
//    $pasport = $aut["PASPORT"];
    $primitka = $aut["PRIM"];

    $adresa = $aut["RAYON"] . ' ' . $aut["TIP_NSP"] . ' ' . $aut["NSP"] . ', ' . $aut["TIP_VUL"] . ' ' . $aut["VUL"] . ', ' . objekt_ner(0,$aut["bud"],$aut["kvar"]);
    $vart = $aut["SUM"];
    $tel = $aut["TEL"];
    $contract_location = $aut["TIP_NSP"] . ' ' . $aut["NSP"];
}
mysql_free_result($atu);

//$dodvl = '';
//$sql = "SELECT PR,IM,PB	FROM zm_dod WHERE IDZM='$kl'";
//$atu = mysql_query($sql);
//while ($aut = mysql_fetch_array($atu)) {
//    $dodvl .= ', ' . $aut["PR"] . ' ' . $aut["IM"] . ' ' . $aut["PB"];
//}
//mysql_free_result($atu);

$grn = (int)$vart;
$kop = fract($vart);
$sumpr = in_str($grn);
if ($kop != 0) $smpr = $sumpr . ' грн. ' . $kop . ' коп.';
else $smpr = $sumpr . ' грн. ';

require('../tfpdf/tfpdf.php');
// створюємо FPDF обєкт
$pdf = new TFPDF();

$pdf->SetAutoPageBreak('true', 2);
$pdf->SetMargins(05, 05, 2);

$pdf->AddFont('dejavu', '', 'DejaVuSans.ttf', true);
$pdf->AddFont('dejavub', '', 'DejaVuSans-Bold.ttf', true);

// Вказуємо автора та заголовок
$pdf->SetAuthor('КП КОР ЗБЕРІГАЧ');
$pdf->SetTitle('Замовлення');

//створюємо нову сторiнку та вказуємо режим її вiдображення
$pdf->AddPage('P');
$pdf->SetDisplayMode('real', 'default');
$pdf->SetDrawColor(50, 60, 100);

$pdf->SetFont('dejavu', '', 10);

if($kod_rob == 6 || $kod_rob == 7){
    $pdf->Text(25, 10, 'КП КОР «Зберігач»');
    $pdf->Text(125, 10, 'Від гр. ' . $zamovnuk);
//    $pdf->Text(125, 15, 'Що проживає:');
    $pdf->SetXY(124, 11);
    $pdf->MultiCell(75, 5, $adresa . '
Тел: ' . $tel, 0, 'L', 0);
//    $pdf->Text(125, 30, 'Тел: ' . $tel);
    $pdf->Text(80, 50, 'Замовлення № ' . $ndog);
//    $pdf->Text(95, 57, $dtdog . 'р.');

    $pdf->Text(20, 70, 'Прошу: ' . $vidrob);
    $pdf->SetXY(19, 72);
    $pdf->MultiCell(185, 7, 'Об’єкт нерухомого майна знаходиться за адресою: ' . $adresa, 0, 'L', 0);
//    $pdf->Text(20, 90, 'Належить: _____________________________________________________________________________');
    $pdf->Text(20, 90, 'До заяви додаються: ' . $primitka);
    $pdf->Text(20, 97, 'Вартість роботи: ' . $vart . 'грн.');
//    $pdf->Text(20, 104, 'Квитанція № ' . $ndog . ' від ' . $dtdog . 'р.');

    if($kod_rob == 6){
        $pdf->SetFont('dejavu', '', 8);
        $pdf->Text(20, 111, 'Зобов’язання та гарантії:');
        $pdf->SetXY(19, 113);
        $pdf->MultiCell(185, 5, '   1. Засвідчую, що до комунального підприємства Київської обласної ради «Зберігач» (далі – Зберігач) надані всі 
       необхідні документи (право власності, технічний паспорт…)
   2. У випадку надання замовником неточних, або недостовірних необхідних документів, Зберігач звільняється від 
       відповідальності, а виконані роботи вважаються виконаними належним чином і підлягають оплаті відповідно до 
       цього замовлення.
   3. Вартість послуг щодо надання інформації про об’єкт нерухомого майна визначається з урахуванням складності та 
       обсягу виконання робіт та складає ' . $vart . ' грн.
   4. Не пізніше трьох робочих днів з дня складання даного замовлення здійснити оплату на розрахунковий рахунок 
       Зберігача у розмірі передбаченим п. 3 даного замовлення.
   5. Термін виконання замовлення щодо надання інформації про об’єкт нерухомого майна рахується  відповідно до 
       чинного законодавства. При необхідності, виконання роботи в скорочений термін розраховується із застосуванням 
       коефіцієнту 2,0 за відсутності порушень замовником передбачених п.4, 1 даного замовлення.   
   6. У випадку порушення замовником зобов’язання даного замовлення Зберігач має право відмовитись від виконання 
       даного замовлення (припинити його юридичну дію) в односторонньому порядку.
   7. Інформація про об’єкт нерухомого майна, виконується після присвоєння інвентаризаційного номера на 
       вищезазначений об’єкт.  
   8. Відповідно до положень Закону України «Про захист персональних даних» надаю згоду на обробку моїх 
       персональних даних Зберігачем, а саме на обробку виданих на моє ім’я документів, підписаних мною документів та 
       відомостей, що надаються мною.
', 0, 'L', 0);
        $y = 220;
    }elseif ($kod_rob == 7){
        $y = 120;
    }
    $pdf->SetFont('dejavu', '', 10);
    $pdf->Text(90, $y, 'Замовник: _________________ ' . $zayavnuk );
    $pdf->Text(69, $y + 12.5, 'Замовлення прийняв: _________________ ' . $user);
    $pdf->Text(20, $y + 25, 'Документи відповідно до замовлення отримав: _________________ ' . $zayavnuk);

}elseif ($kod_rob == 1 || $kod_rob == 5){
    $sql = "SELECT * FROM yur_kl WHERE yur_kl.EDRPOU='$edrpou' AND yur_kl.DL='1'";
    $atu = mysql_query($sql);
    while ($aut = mysql_fetch_array($atu)) {
        $ndog = $aut["N_DOG"];
        $dtdog = german_date($aut["DT_DOG"]);
        $name_client = $aut["NAME"];
        $address = $aut["ADRES"];
        $phone = $aut["TELEF"];
        $bank = $aut["BANK"];
        $rahunok = $aut["RR"];
        $boss_f = $aut["BOSS_F"];
        $pidstava = $aut["PIDSTAVA"];
    }
    mysql_free_result($atu);

    $pdf->SetFont('dejavu', '', 12);
    $pdf->Text(60, 10, 'Договір про надання послуг №' . $ndog);
    $pdf->SetFont('dejavu', '', 10);
    $pdf->Text(20, 15, $contract_location);
    $pdf->Text(165, 15, 'Дaта: ' . $dtdog . 'р.');
    $pdf->SetXY(19, 20);
    $pdf->MultiCell(188, 5, 'Комунальне підприємство Київської обласної ради «Зберігач», юридична особа публічного права код ЄДРПОУ: 38733758, в особі генерального директора Костиліна Олега Ярославовича, що діє на підставі Статуту (далі – Виконавець) з однієї сторони, та ' . $name_client .          ' юридична особа, код ЄДРПОУ : ' . $edrpou . ', в особі ' . $boss_f . ' ,                                              що діє на підставі Статуту' . $pidstava . ' (далі – Замовник), з однієї сторони, далі Замовник і Виконавець разом іменуються як Сторони, уклали цей Договір про наступне:', 0, 'L', 0);
						//   Комунальне підприємство Київської обласної ради «Зберігач», юридична особа публічного права код ЄДРПОУ: 38733758, в особі генерального директора Костиліна Олега Ярославовича, що діє на підставі Статуту (далі – Виконавець) з однієї сторони, та КП КОР «Київське обласне БТІ» юридична особа, код ЄДРПОУ : 38250947,        в особі в.о. генерального директора Кондратенко Олексія Євгенійовича , що діє на підставі Статуту                  (далі – Замовник), з другої сторони, далі Замовник і Виконавець разом іменуються як Сторони, уклали цей Договір про наступне:
    $pdf->SetFont('dejavub', '', 10);
    $pdf->Text(80, 58, '1.Загальні положення.');
    $pdf->SetFont('dejavu', '', 10);
    $pdf->SetXY(19, 60);
    $pdf->MultiCell(188, 5, '1.1 Цей Договір про надання послуг (далі –Договір) є основним договором, який встановлює порядок та умови надання послуг, оплати за них та укладається Сторонами.
1.2 Умови та порядок надання послуг за цим Договором регулюються додатками до договору та додатковими угодами:
Додаток 1 - Перелік адрес матеріалів технічної інвентаризації об’єктів нерухомого майна, які здаються на постійне зберігання.
Додаток 2 – Перелік адрес матеріалів технічної інвентаризації об’єктів нерухомого майна, які приймаються на постійне зберігання.
Додаток 3 – Перелік адрес матеріалів технічної інвентаризації об’єктів нерухомого майна, які повертаються на доопрацювання.
Додаток 4 - Перелік адрес об’єктів нерухомого майна,  на які суб’єкт господарювання надає запит про надання матеріалів технічної інвентаризації для проведення технічної інвентаризації.
Додаток 5 – Перелік адрес матеріалів технічної інвентаризації об’єктів нерухомого майна, які видаються суб’єкту господарювання для проведення технічної інвентаризації.
Додаток 6 – Повідомлення про відсутність матеріалів технічної інвентаризації на об’єкт нерухомого майна. 
1.3 Всі додатки та додаткові угоди до Договору є невід’ємною його частиною. Кожному додатку надається серія, яка ідентифікує дату, тип та кількість звернень Замовника до Виконавця протягом терміну дії цього Договору.', 0, 'L', 0);
    $pdf->SetFont('dejavub', '', 10);
    $pdf->Text(85, 163, '2.Предмет договору.');
    $pdf->SetFont('dejavu', '', 10);
    $pdf->SetXY(19, 165);
    $pdf->MultiCell(188, 5, '2.1 Відповідно до умов цього Договору, Виконавець приймає на постійне зберігання матеріали технічної інвентаризації об’єктів нерухомого майна, адреси яких зазначені в Додатку 1, а Замовник зобов’язується надати всі необхідні документи та провести оплату.
2.2 Виконавець приймає звернення із запитом про надання копій матеріалів технічної інвентаризації об’єктів нерухомого майна, адреси яких зазначені в Додатку 4, а Замовник зобов’язується надати всі необхідні документи та провести оплату.
2.3 Замовник надає матеріали технічної інвентаризації та запити відповідно до "Інструкції про порядок проведення технічної інвентаризації об’єктів нерухомого майна", затвердженої наказом Державного комітету архітектури та житлової політики України від 24 травня 2001 року № 127, зі змінами та доповненнями.
2.4 Виконавець виконує роботи керуючись у своїй діяльності чинним законодавством, делегованими повноваженнями Київської обласної ради та "Інструкцією про порядок проведення технічної інвентаризації об’єктів нерухомого майна", затвердженої наказом Державного комітету архітектури та житлової політики України від 24 травня 2001 року № 127, зі змінами та доповненнями.', 0, 'L', 0);
    $pdf->SetFont('dejavub', '', 10);
    $pdf->Text(68, 250, '3. Вартість та порядок оплати послуг.');
    $pdf->SetFont('dejavu', '', 10);
    $pdf->SetXY(19, 252);
    $pdf->MultiCell(188, 5, '3.1 Сума за виконання  послуг залежить від кількості поданих адресних номерів, типу об’єкту та зазначається в Додатку 1, Додатку 4 або Додатку 5 до цього Договору.
Вартість однієї послуги, що виконується по одному адресному номеру: 
на будинок садибного типу з господарськими будівлями та спорудами, на квартиру, житлові кімнати, житлові блоки у гуртожитках, на садовий (дачний) будинок, на гараж (машино-місце), на групу нежитлових приміщень, на допоміжну (господарську) будівлю, яка не належить до садибного, дачного та садового будинку тощо… складає 500 грн. з урахуванням ПДВ.
Вартість однієї послуги, що виконується по одному адресному номеру: 
будинки і споруди громадського та виробничого (в тому числі сільськогосподарського) призначення та їх комплекси, на будинок квартирного типу різної поверховості, гуртожиток, секції, на захисну споруду цивільного захисту з господарськими (допоміжними) будівлями та спорудами, гаражі та паркінги з машино-місцями (що не належать до господарських будівель: багатоповерхові, підземні, одноповерхові, блокові), Багатофункціональні будинки для тримання засуджених та осіб, узятих під варту (блочного, казарменого та камерного типу установ виконання покарань та слідчих ізоляторів) тощо… складає 1500 грн. з урахуванням ПДВ.
У разі неможливості надати матеріали технічної інвентаризації, Замовнику надається повідомлення відповідно до Додатку 6 за певний адресний номер в сумі 250 грн. з урахуванням ПДВ.
3.2 Оплата послуг за даним Договором проводиться Замовником, шляхом перерахування суми коштів на розрахунковий рахунок Виконавця протягом 3-х робочих днів з моменту підписання Додатку 1, Додатку 4 або Додатку 5.
3.3 Вартість за надання послуг може бути змінена на основі перерахунку вартості 1-єї нормо-години Виконавцем при підписанні Сторонами додаткової угоди.
3.4 У разі виконання послуги в скорочений термін до вартості застосовується коефіцієнт 2.
3.5 Акт наданих послуг у разі потреби підписується Сторонами до 10 числа місяця, наступного за календарним місяцем, в якому фактично надавалися послуги та не пізніше 5-ти робочих днів з моменту їх отримання.
', 0, 'L', 0);
/*    $pdf->AddPage('P');
    $pdf->SetXY(19, 10);
    $pdf->MultiCell(188, 5, '3.5 У разі виконання послуги в скорочений термін до вартості 1 нормо-години застосовується
коефіцієнт 2.', 0, 'L', 0);*/
    $pdf->SetFont('dejavub', '', 10);
    $pdf->Text(60, 110, '4. Строки дії Договору та надання послуги.');
    $pdf->SetFont('dejavu', '', 10);
    $pdf->SetXY(19, 112);
    $pdf->MultiCell(188, 5, '4.1 Цей Договір набуває чинності з дати його укладення й підписання обома Сторонами та діє протягом трьох років.
4.2 Послуги надаються з моменту надходження суми коштів на розрахунковий рахунок Виконавця.
4.3 Виконавець відповідно до результатів виконання послуг зазначених в п. 2.1 та 2.2 цього договору надає Замовнику  для підписання Додаток 2 та/або Додаток 3.
4.4 У разі повернення матеріалів відповідно до Додатку 3, оплата за надання послуг відповідно до Додатку 1 не змінюється.
4.5 Окремі види послуг можуть надаватися за допомогою електронних комунікацій за попередньою домовленістю.
4.6 Договір може бути розірваний за взаємною згодою сторін. Одностороннє розірвання Договору можливе лише у випадках передбачених цим Договором або при систематичному порушенні порядку зверненя, згідно нормативних актів чинного законодавства.
4.7 Жодна із Сторін не несе відповідальність за невиконання чи неналежне
виконання своїх зобов\'язань по цьому Договору, якщо це невиконання чи
неналежне виконання зумовлені дією обставин непереборної сили (форс-мажорних
обставин).
4.8 Замовник дає Виконавцю свою згоду на обробку та використання його персональних даних.
4.9 Договір складено в двох оригінальних примірниках, по одному для кожної із сторін, підписано та скріплено печатками Сторін (за наявності).
4.10 Договір вважається таким, що продовжений, якщо за місяць до закінчення строку його дії одна із сторін не заявила про відмову від договору або про його перегляд.', 0, 'L', 0);
    $pdf->SetFont('dejavub', '', 10);
    $pdf->Text(85, 230, '5. Реквізити сторін.');
    $pdf->Text(50, 237, 'Виконавець');
    $pdf->Text(150, 237, 'Замовник');
    $pdf->Text(20, 242, 'КП КОР “Зберігач”');
    $pdf->Text(116, 242, $name_client);
    $pdf->SetFont('dejavu', '', 10);
    $pdf->SetXY(19, 247);
    $pdf->MultiCell(90, 5, 'Поштова адреса: 08205, Київська область,
місто Ірпінь, вул. Миру, 2-а
Тел.: 098 012 28 02
ЄДРПОУ: 38733758
Банк: АБ “Укргазбанк”
Р/рахунок: UA703204780000026009924432768

Генеральний директор _____________________', 0, 'L', 0);

    $pdf->SetXY(115, 247);
    $pdf->MultiCell(93, 5, 'Поштова адреса: ' . $address . '
Тел.: ' . $phone . '
ЄДРПОУ: ' . $edrpou . '
Банк: ' . $bank . '
Р/рахунок: ' . $rahunok . '

Генеральний директор _____________________', 0, 'L', 0);


}


//Zakrutie bazu
if (mysql_close($db)) {
    // echo("Закриття бази даних");
} else {
    echo("Не можливо виконати закриття бази");
}
$pdf->Output('dogovir.pdf', 'I');
